EDT/УТ/src/Catalogs/новаТранспорт/новаТранспорт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>новаТранспорт</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>ВнешняяМаршрутизация</name>
      <description>Внешняя маршрутизация</description>
    </items>
  </predefined>
  <attributes>
    <name>Вид</name>
    <type>
      <types>CatalogRef.новаВидыТранспорта</types>
    </type>
  </attributes>
  <attributes>
    <name>Марка</name>
    <type>
      <types>CatalogRef.новаМаркиТранспорта</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерГосударственнойРегистрации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Грузоподъемность</name>
    <comment>В тоннах</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВысотаКузова</name>
    <comment>В метрах</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШиринаКузова</name>
    <comment>В метрах</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГлубинаКузова</name>
    <comment>В метрах</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемКузова</name>
    <comment>В кубических метрах</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.новаКонтрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ГаражныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПолнаяВысотаКузова</name>
    <comment>В метрах (используется для ограничений прохождения по улицам)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.новаСклады</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоВыбранныхКатегорий</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоВыбранныхРайонов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Вместимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойВодитель</name>
    <type>
      <types>CatalogRef.новаВодители</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойГараж</name>
    <type>
      <types>CatalogRef.новаГаражи</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипКузова</name>
    <type>
      <types>CatalogRef.новаТипыКузовов</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособЗагрузки</name>
    <type>
      <types>CatalogRef.новаСпособыЗагрузки</types>
    </type>
  </attributes>
  <attributes>
    <name>Пропуск</name>
    <type>
      <types>CatalogRef.новаТипыПропусков</types>
    </type>
  </attributes>
  <attributes>
    <name>Лифт</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Манипулятор</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СанитарныйПаспорт</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РайонСтоянки</name>
    <type>
      <types>CatalogRef.новаГеоРайоны</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерПрицепа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойБак</name>
    <type>
      <types>CatalogRef.новаБакиТранспорта</types>
    </type>
  </attributes>
  <attributes>
    <name>ИндивидуальныеНормы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СобственныйВес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КатегорииТранспортаСтрокой</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>90</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерЛог</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаёмныйТранспорт</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>БезМобильногоПриложения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипТранспорта</name>
    <type>
      <types>CatalogRef.ТипыТранспортаДляЛогистики</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаЗаКилометр</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальнаяСкорость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТерминалДоставки</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </attributes>
  <attributes>
    <name>Префикс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВнешнийОператорМаршрутизации</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КатегорииТранспорта</name>
    <attributes>
      <name>ЗначениеКатегории</name>
      <type>
        <types>CatalogRef.новаЗначенияКатегорийТранспорта</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Районы</name>
    <attributes>
      <name>Район</name>
      <type>
        <types>CatalogRef.новаГеоРайоны</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

EDT/УТ/src/InformationRegisters/СформированныеЭкипажи/СформированныеЭкипажи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СформированныеЭкипажи</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Водитель</name>
    <type>
      <types>CatalogRef.новаВодители</types>
    </type>
  </resources>
  <resources>
    <name>Экспедитор</name>
    <type>
      <types>CatalogRef.новаЭкспедиторы</types>
    </type>
  </resources>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>Регион</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Транспорт</name>
    <type>
      <types>CatalogRef.новаТранспорт</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/InformationRegisters/СостоянияАвтотранспорта/СостоянияАвтотранспорта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СостоянияАвтотранспорта</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>СостояниеТранспорта</name>
    <type>
      <types>EnumRef.СостоянияАвтотранспорта</types>
    </type>
  </resources>
  <resources>
    <name>Водитель</name>
    <type>
      <types>CatalogRef.новаВодители</types>
    </type>
  </resources>
  <resources>
    <name>Экспедитор</name>
    <type>
      <types>CatalogRef.новаЭкспедиторы</types>
    </type>
  </resources>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>Транспорт</name>
    <type>
      <types>CatalogRef.новаТранспорт</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/Catalogs/новаТранспорт/Forms/ФормаСпискаУпр/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// Михушкин --->>
	//Если РольДоступна("РегиональныйЛогист") Тогда	
	//	Элементы.ФормаКоманднаяПанель.Доступность = Ложь;	
	//	ЭтаФорма.ТолькоПросмотр = Истина;
	//КонецЕсли;
	// <<--- Михушкин
	
КонецПроцедуры

//CeHbKA #3733 27.01.2020
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ПользовательИБ = ПользователиИнформационнойБазы.ТекущийПользователь();
	Элементы.ФормаСтатус.Доступность = ПользовательИБ.Роли.Содержит(Метаданные.Роли.УправлениеСостояниемАвтотранспорта);
	
	Элементы.ФормаСтатус.ТолькоПросмотр = НЕ ПользовательИБ.Роли.Содержит(Метаданные.Роли.УправлениеСостояниемАвтотранспорта);
	
	Для каждого ЭлементЗначение Из Метаданные.Перечисления.СостоянияАвтотранспорта.ЗначенияПеречисления Цикл
		
		// создадим команду
		НоваяКоманда = Команды.Добавить("Статус"+ЭлементЗначение.Имя);
		НоваяКоманда.Заголовок  = ЭлементЗначение.Синоним;
		НоваяКоманда.Действие   = "ВыполнитьДействиеКомандыЗаписатьСостояние";
		
		// создадим кнопку
		НовыйЭлемент        = Элементы.Добавить("Статус"+ЭлементЗначение.Имя, Тип("КнопкаФормы"), Элементы.ФормаСтатус);
		НовыйЭлемент.Вид    = ВидКнопкиФормы.КнопкаКоманднойПанели;
		НовыйЭлемент.Заголовок  = ЭлементЗначение.Синоним;
		НовыйЭлемент.ИмяКоманды = "Статус"+ЭлементЗначение.Имя;		
		
		НовыйЭлемент.Доступность = Элементы.ФормаСтатус.Доступность;
		
	КонецЦикла; 	
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьДействиеКомандыЗаписатьСостояние(Команда)

	Если Элементы.Список.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	ИмяСостояния = СтрЗаменить(Команда.Имя, "Статус", "");
	СостояниеТранспорта = ПредопределенноеЗначение("Перечисление.СостоянияАвтотранспорта."+ИмяСостояния);
	
	РезультатЗаписи = СделатьЗаписьВРегистрСведенийСостоянияАвтотранспорта(Элементы.Список.ТекущаяСтрока, СостояниеТранспорта);
	
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = РезультатЗаписи;
	Сообщение.Поле = "Список";
	Сообщение.Сообщить(); 
	
	Элементы.Список.Обновить();
	
КонецПроцедуры // ()
 
&НаСервере
Функция СделатьЗаписьВРегистрСведенийСостоянияАвтотранспорта(Транспорт, СостояниеТранспорта)
	
	Если Транспорт.ЭтоГруппа Тогда
		Возврат "Для группы транспорта нельзя устанавливать статус!";
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	новаТранспорт.Ссылка КАК Транспорт,
		|	ЕСТЬNULL(СформированныеЭкипажиСрезПоследних.Водитель, ЗНАЧЕНИЕ(Справочник.новаВодители.ПустаяСсылка)) КАК Водитель,
		|	ЕСТЬNULL(СформированныеЭкипажиСрезПоследних.Экспедитор, ЗНАЧЕНИЕ(Справочник.новаЭкспедиторы.ПустаяСсылка)) КАК Экспедитор
		|ИЗ
		|	Справочник.новаТранспорт КАК новаТранспорт
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СформированныеЭкипажи.СрезПоследних КАК СформированныеЭкипажиСрезПоследних
		|		ПО СформированныеЭкипажиСрезПоследних.Транспорт = новаТранспорт.Ссылка
		|ГДЕ
		|	новаТранспорт.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Транспорт);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Набор = РегистрыСведений.СостоянияАвтотранспорта.СоздатьНаборЗаписей();
	Набор.Отбор.Транспорт.Установить(Транспорт);

	Набор.Прочитать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл

		Запись = Набор.Добавить();
		Запись.Период = ТекущаяДата();
		Запись.Транспорт = Транспорт;
		Запись.СостояниеТранспорта = СостояниеТранспорта;
		Запись.Водитель = ВыборкаДетальныеЗаписи.Водитель;
		Запись.Экспедитор = ВыборкаДетальныеЗаписи.Экспедитор;
		Запись.Пользователь = ПараметрыСеанса.ТекущийПользователь;
		
	КонецЦикла;
	
	Набор.Записать();
	
	Возврат "Для транспорта "+Транспорт+" изменено состояние на "+СостояниеТранспорта;;
	
КонецФункции // ()
//CeHbKA #3733 27.01.2020
